events/Data Storage Events/Metadata.forumPost/ALERT.ForumSensor.ForumPostNew.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <s:Header></s:Header>
    <s:Body>
        <wsnt:Notify>
            <wsnt:NotificationMessage>
                <wsnt:Topic></wsnt:Topic>
                <wsnt:ProducerReference>
                    <wsa:Address>http://www.alert-project.eu/forumSensor</wsa:Address>
                </wsnt:ProducerReference>
                <wsnt:Message>
                    <ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki"    xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
                        <ns1:head>
                            <ns1:sender>ForumSensor</ns1:sender>
                            <ns1:timestamp>10000</ns1:timestamp>
                            <ns1:sequencenumber>1</ns1:sequencenumber>
                        </ns1:head>
                        <ns1:payload>
                            <ns1:meta>
                                <ns1:startTime>10010</ns1:startTime>
                                <ns1:endTime>10010</ns1:endTime>
                                <!-- name of event -->
                                <ns1:eventName>ALERT.ForumSensor.ForumPostNew</ns1:eventName>
                                <ns1:eventId>5748</ns1:eventId>
                                <ns1:eventType>request</ns1:eventType>
                            </ns1:meta>
                            <ns1:eventData>
                                <r:forumSensor>
                                    <!-- forum account id, specified by forum sensor -->
                                    <r:forumSensorAccountId>0</r:forumSensorAccountId>
                                    <!-- forum item ID -->
                                    <r:forumItemId>1423</r:forumItemId>
                                    <!-- forum ID -->
                                    <r:forumId>3558</r:forumId>
                                    <!-- forum name -->
                                    <r:forumName>KDE Forums</r:forumName>
                                    <!-- thread ID -->
                                    <r:forumThreadId>3559</r:forumThreadId>
                                    <!-- post ID -->
                                    <r:postId>3560</r:postId>
                                    <!-- time -->
                                    <r:time>2011-04-15 10:55:57</r:time>
                                    <!-- subject -->
                                    <r:subject><![CDATA[Development :: Re:amaroK and Qt4]]></r:subject>
                                    <!-- body -->
                                    <r:body><![CDATA[good. Now, where is a good place to start? Maybe to load up the amaroK source code in kdevelop, and start experimenting by touching it here and there?]]></r:body>
                                    <!-- author -->
                                    <r:author>boudewijn</r:author>
                                    <!-- category -->
                                    <r:category>Development</r:category>
                                </r:forumSensor>
                            </ns1:eventData>
                        </ns1:payload>
                    </ns1:event>
                </wsnt:Message>
            </wsnt:NotificationMessage>
        </wsnt:Notify>
    </s:Body>
</s:Envelope>
